Repository: kitknox/rootshell
Catalog: Localizable.xcstrings
Source language: en
Languages: ar, ca, cs, da, de, es, fi, fr, he, hu, it, ja, ko, nb, nl, pl, pt_br, pt_pt, ro, sl, sv, uk, vi, zh_hans, zh_hant

source: Logs every checkpoint on the background → foreground path with timestamps and deltas. The renderer drain toggle restores the old scene-update behavior for A/B testing and is off by default.
ar: يسجّل كل نقطة تحقق على المسار من الخلفية → الواجهة مع الطوابع الزمنية والفروقات. مفتاح تفريغ المُصيِّر يستعيد سلوك تحديث المشهد القديم لاختبار A/B وهو معطّل افتراضيًا.
ca: Registra cada punt de control al camí segon pla → primer pla amb marques de temps i diferències. L'opció de buidatge del renderitzador restaura el comportament antic d'actualització d'escena per a proves A/B i està desactivada per defecte.
cs: Zaznamenává každý kontrolní bod na cestě z pozadí do popředí s časovými značkami a rozdíly. Přepínač synchronního vyprázdnění rendereru obnovuje původní chování aktualizace scény pro A/B testování a je ve výchozím nastavení vypnutý.
da: Logger hvert kontrolpunkt på stien baggrund → forgrund med tidsstempler og deltaer. Kontakten for renderertømning gendanner den gamle scene-opdateringsadfærd til A/B-test og er slået fra som standard.
de: Protokolliert jeden Checkpoint auf dem Pfad Hintergrund → Vordergrund mit Zeitstempeln und Deltas. Der Schalter zum Renderer-Drain stellt das alte Verhalten der Szenenaktualisierung für A/B-Tests wieder her und ist standardmäßig deaktiviert.
es: Registra cada punto de control en la ruta segundo plano → primer plano con marcas de tiempo y diferencias. La opción de vaciado del renderizador restaura el comportamiento antiguo de actualización de escena para pruebas A/B y está desactivada de forma predeterminada.
fi: Kirjaa jokaisen tarkistuspisteen reitillä tausta → etuala aikaleimoineen ja delta-arvoineen. Renderöijän tyhjennyksen kytkin palauttaa vanhan näkymäpäivitystoiminnan A/B-testausta varten ja on oletuksena pois käytöstä.
fr: Journalise chaque point de contrôle sur le chemin arrière-plan → premier plan avec horodatages et écarts. L'option de vidage du moteur de rendu restaure l'ancien comportement de mise à jour de scène pour les tests A/B et est désactivée par défaut.
he: מתעד כל נקודת ביקורת בנתיב מהרקע → לחזית עם חותמות זמן והפרשים. מתג ניקוז המעבד משחזר את התנהגות עדכון הסצנה הישנה לבדיקות A/B והוא כבוי כברירת מחדל.
hu: Az összes ellenőrzési pontot naplózza a háttér → előtér útvonalon időbélyegekkel és eltérésekkel. A renderelő szinkron ürítésére szolgáló kapcsoló A/B teszteléshez visszaállítja a korábbi jelenetfrissítési viselkedést, és alapértelmezés szerint ki van kapcsolva.
it: Registra ogni checkpoint sul percorso secondo piano → primo piano con timestamp e delta. L'opzione di svuotamento del renderer ripristina il vecchio comportamento di aggiornamento della scena per i test A/B ed è disattivata per impostazione predefinita.
ja: バックグラウンド → フォアグラウンドの経路上のすべてのチェックポイントを、タイムスタンプと差分付きで記録します。レンダラードレインのトグルはA/Bテスト用に旧来のシーン更新動作を復元するもので、デフォルトではオフです。
ko: 백그라운드 → 포그라운드 경로의 모든 체크포인트를 타임스탬프 및 차이값과 함께 기록합니다. 렌더러 드레인 토글은 A/B 테스트를 위해 이전 장면 업데이트 동작을 복원하며 기본적으로 꺼져 있습니다.
nb: Logger hvert kontrollpunkt på stien bakgrunn → forgrunn med tidsstempler og deltaer. Bryteren for renderertømming gjenoppretter den gamle scene-oppdateringsatferden for A/B-testing og er av som standard.
nl: Registreert elk controlepunt op het pad achtergrond → voorgrond met tijdstempels en delta's. De schakelaar voor renderer-drain herstelt het oude scènebijwerkgedrag voor A/B-tests en staat standaard uit.
pl: Rejestruje każdy punkt kontrolny na ścieżce tło → pierwszy plan ze znacznikami czasu i deltami. Przełącznik synchronicznego opróżniania renderera przywraca dawne zachowanie aktualizacji sceny na potrzeby testów A/B i jest domyślnie wyłączony.
pt_br: Registra cada ponto de verificação no caminho segundo plano → primeiro plano com marcações de tempo e deltas. A opção de esvaziamento do renderizador restaura o comportamento antigo de atualização de cena para testes A/B e fica desativada por padrão.
pt_pt: Regista cada ponto de verificação no caminho segundo plano → primeiro plano com marcas temporais e diferenças. A opção de esvaziamento do renderizador restaura o comportamento antigo de atualização de cena para testes A/B e está desativada por predefinição.
ro: Înregistrează fiecare punct de control pe traseul fundal → prim-plan cu marcaje de timp și diferențe. Comutatorul de golire a redării restabilește vechiul comportament de actualizare a scenei pentru testarea A/B și este dezactivat în mod implicit.
sl: Beleži vsako kontrolno točko na poti ozadje → ospredje s časovnimi žigi in razlikami. Preklop sinhronega praznjenja izrisovalnika obnovi staro vedenje posodabljanja scene za A/B testiranje in je privzeto izklopljen.
sv: Loggar varje kontrollpunkt på vägen bakgrund → förgrund med tidsstämplar och deltavärden. Reglaget för renderartömning återställer det gamla scenuppdateringsbeteendet för A/B-tester och är inaktiverat som standard.
uk: Записує кожну контрольну точку на шляху фон → передній план із позначками часу та різницями. Перемикач синхронного спорожнення рендерера відновлює стару поведінку оновлення сцени для A/B-тестування та типово вимкнений.
vi: Ghi lại mọi điểm kiểm tra trên đường nền → tiền cảnh kèm dấu thời gian và độ chênh lệch. Tùy chọn xả bộ kết xuất khôi phục hành vi cập nhật cảnh cũ phục vụ thử nghiệm A/B và mặc định là tắt.
zh_hans: 记录后台 → 前台路径上的每个检查点，包含时间戳和差值。渲染器排空开关用于 A/B 测试时恢复旧的场景更新行为，默认关闭。
zh_hant: 記錄背景 → 前景路徑上的每個檢查點，包含時間戳記與差值。算繪器排空切換用於 A/B 測試時還原舊的場景更新行為，預設關閉。

source: Logs SSH handshake details (KEX, host key, auth, channel) similar to `ssh -vv`. Passwords and private keys are never logged.
ar: يسجّل تفاصيل مصافحة SSH (KEX، مفتاح المضيف، المصادقة، القناة) بشكل مشابه لـ `ssh -vv`. لا يتم تسجيل كلمات المرور والمفاتيح الخاصة أبدًا.
ca: Registra els detalls de la negociació SSH (KEX, clau d'amfitrió, autenticació, canal) de manera similar a `ssh -vv`. Les contrasenyes i claus privades mai no es registren.
cs: Zaznamenává podrobnosti SSH handshaku (KEX, klíč hostitele, ověření, kanál) podobně jako `ssh -vv`. Hesla a soukromé klíče se nikdy nezaznamenávají.
da: Logger detaljer om SSH-håndtryk (KEX, værtsnøgle, godkendelse, kanal) svarende til `ssh -vv`. Adgangskoder og private nøgler logges aldrig.
de: Protokolliert Details des SSH-Handshakes (KEX, Hostschlüssel, Authentifizierung, Kanal) ähnlich wie `ssh -vv`. Passwörter und private Schlüssel werden niemals protokolliert.
es: Registra los detalles del intercambio SSH (KEX, clave de host, autenticación, canal) de forma similar a `ssh -vv`. Las contraseñas y claves privadas nunca se registran.
fi: Kirjaa SSH-kättelyn tiedot (KEX, isäntäavain, todennus, kanava) komennon `ssh -vv` tapaan. Salasanoja ja yksityisiä avaimia ei koskaan kirjata.
fr: Journalise les détails de la négociation SSH (KEX, clé d'hôte, authentification, canal) de façon similaire à `ssh -vv`. Les mots de passe et clés privées ne sont jamais journalisés.
he: מתעד פרטי לחיצת היד של SSH (KEX, מפתח מארח, אימות, ערוץ) בדומה ל-`ssh -vv`. סיסמאות ומפתחות פרטיים לעולם לא מתועדים.
hu: Naplózza az SSH kézfogás részleteit (KEX, gazdakulcs, hitelesítés, csatorna) az `ssh -vv` mintájára. Jelszavak és privát kulcsok soha nem kerülnek naplózásra.
it: Registra i dettagli dell'handshake SSH (KEX, chiave host, autenticazione, canale) in modo simile a `ssh -vv`. Le password e le chiavi private non vengono mai registrate.
ja: `ssh -vv`と同様にSSHハンドシェイクの詳細（KEX、ホストキー、認証、チャネル）を記録します。パスワードと秘密鍵は記録されません。
ko: `ssh -vv`와 유사하게 SSH 핸드셰이크 세부 정보(KEX, 호스트 키, 인증, 채널)를 기록합니다. 비밀번호와 개인 키는 절대 기록되지 않습니다.
nb: Logger detaljer om SSH-håndtrykket (KEX, vertsnøkkel, autentisering, kanal) tilsvarende `ssh -vv`. Passord og private nøkler logges aldri.
nl: Registreert details van de SSH-handshake (KEX, hostsleutel, authenticatie, kanaal) vergelijkbaar met `ssh -vv`. Wachtwoorden en privésleutels worden nooit geregistreerd.
pl: Rejestruje szczegóły uzgadniania SSH (KEX, klucz hosta, uwierzytelnianie, kanał) podobnie do `ssh -vv`. Hasła i klucze prywatne nigdy nie są zapisywane.
pt_br: Registra os detalhes do handshake SSH (KEX, chave do host, autenticação, canal) de forma semelhante a `ssh -vv`. Senhas e chaves privadas nunca são registradas.
pt_pt: Regista os detalhes do handshake SSH (KEX, chave do anfitrião, autenticação, canal) de forma semelhante a `ssh -vv`. As palavras-passe e chaves privadas nunca são registadas.
ro: Înregistrează detaliile negocierii SSH (KEX, cheia gazdei, autentificare, canal) similar cu `ssh -vv`. Parolele și cheile private nu sunt înregistrate niciodată.
sl: Beleži podrobnosti rokovanja SSH (KEX, ključ gostitelja, overitev, kanal) podobno kot `ssh -vv`. Gesla in zasebni ključi se nikoli ne beležijo.
sv: Loggar detaljer om SSH-handskakningen (KEX, värdnyckel, autentisering, kanal) liknande `ssh -vv`. Lösenord och privata nycklar loggas aldrig.
uk: Записує деталі рукостискання SSH (KEX, ключ хоста, автентифікацію, канал) подібно до `ssh -vv`. Паролі та приватні ключі ніколи не записуються.
vi: Ghi lại chi tiết bắt tay SSH (KEX, khóa máy chủ, xác thực, kênh) tương tự như `ssh -vv`. Mật khẩu và khóa riêng tư không bao giờ được ghi lại.
zh_hans: 记录 SSH 握手细节（KEX、主机密钥、认证、通道），类似于 `ssh -vv`。密码和私钥绝不会被记录。
zh_hant: 記錄 SSH 交握細節（KEX、主機金鑰、驗證、通道），類似於 `ssh -vv`。密碼與私密金鑰永遠不會被記錄。

source: Logs the tmux -CC reconcile/apply timeline, commands sent, the resume watchdog, and a live-state heartbeat (with a core viewer snapshot). Terminal output, titles, and keystrokes are never logged — only ids, sizes, byte counts, and durations.
ar: يُسجِّل الجدول الزمني للمطابقة/التطبيق في tmux -CC، والأوامر المُرسَلة، ومراقب الاستئناف، ونبضة الحالة المباشرة (مع لقطة من العارض الأساسي). لا يتم أبداً تسجيل مُخرَجات الطرفية أو العناوين أو ضغطات المفاتيح — تُسجَّل فقط المعرّفات والأحجام وأعداد البايتات والمدد الزمنية.
ca: Registra la cronologia de reconciliació/aplicació de tmux -CC, les ordres enviades, el watchdog de represa i un batec d'estat en directe (amb una instantània del visor del nucli). La sortida del terminal, els títols i les pulsacions de tecles no es registren mai — només identificadors, mides, recomptes de bytes i durades.
cs: Zaznamenává časovou osu reconcile/apply pro tmux -CC, odeslané příkazy, hlídač obnovení a průběžný stavový signál (se snímkem prohlížeče jádra). Výstup terminálu, názvy ani stisky kláves se nikdy nezaznamenávají — pouze identifikátory, velikosti, počty bajtů a doby trvání.
da: Logger tmux -CC's reconcile/apply-tidslinje, sendte kommandoer, genoptagelses-watchdoggen og et live-tilstands-heartbeat (med et øjebliksbillede af kernens viewer). Terminaluddata, titler og tastetryk logges aldrig — kun id'er, størrelser, byteantal og varigheder.
de: Protokolliert die Reconcile-/Apply-Zeitachse von tmux -CC, gesendete Befehle, den Resume-Watchdog und einen Live-Status-Heartbeat (mit einer Momentaufnahme des Core-Viewers). Terminalausgabe, Titel und Tastenanschläge werden niemals protokolliert — nur IDs, Größen, Byte-Anzahlen und Zeitdauern.
es: Registra la cronología de reconciliación/aplicación de tmux -CC, los comandos enviados, el watchdog de reanudación y un latido de estado en vivo (con una instantánea del visor del núcleo). La salida del terminal, los títulos y las pulsaciones de teclas nunca se registran — solo identificadores, tamaños, recuentos de bytes y duraciones.
fi: Kirjaa tmux -CC:n täsmäytyksen/käytön aikajanan, lähetetyt komennot, jatkamisen vahtikoiran ja reaaliaikaisen tilan sykkeen (mukaan lukien ytimen katselimen tilannekuvan). Päätteen tulostetta, otsikoita ja näppäinpainalluksia ei koskaan kirjata — vain tunnukset, koot, tavumäärät ja kestot.
fr: Enregistre la chronologie de réconciliation/application de tmux -CC, les commandes envoyées, le chien de garde de reprise et un signal d'activité de l'état en direct (avec un instantané du visualiseur du cœur). La sortie du terminal, les titres et les frappes au clavier ne sont jamais enregistrés — seuls le sont les identifiants, les tailles, le nombre d'octets et les durées.
he: מתעד את ציר הזמן של ההתאמה/היישום של tmux -CC, הפקודות שנשלחו, מנגנון הפיקוח של החידוש ופעימת מצב חי (עם תמונת מצב של מציג הליבה). פלט המסוף, הכותרות וההקשות לעולם אינם נרשמים — רק מזהים, גדלים, ספירות בתים ומשכי זמן.
hu: Naplózza a tmux -CC egyeztetési/alkalmazási idővonalat, az elküldött parancsokat, a folytatás-figyelőt és egy élő állapotú szívverést (a mag-megjelenítő pillanatképével). A terminál kimenete, a címek és a billentyűleütések soha nem kerülnek naplózásra — csak azonosítók, méretek, bájtszámok és időtartamok.
it: Registra la cronologia di riconciliazione/applicazione di tmux -CC, i comandi inviati, il watchdog di ripresa e un heartbeat dello stato in tempo reale (con un'istantanea del viewer del core). L'output del terminale, i titoli e i tasti premuti non vengono mai registrati — solo id, dimensioni, conteggi di byte e durate.
ja: tmux -CCの調整/適用のタイムライン、送信されたコマンド、再開ウォッチドッグ、ライブ状態のハートビート（コアビューアーのスナップショットを含む）を記録します。ターミナルの出力、タイトル、キー入力は記録されません。記録されるのはID、サイズ、バイト数、所要時間のみです。
ko: tmux -CC의 조정/적용 타임라인, 전송된 명령, 재개 워치독, 실시간 상태 하트비트(코어 뷰어 스냅샷 포함)를 기록합니다. 터미널 출력, 제목, 키 입력은 절대 기록되지 않습니다 — ID, 크기, 바이트 수, 소요 시간만 기록됩니다.
nb: Logger tidslinjen for tmux -CC-avstemming/-anvendelse, sendte kommandoer, gjenopptaksvakthunden og en sanntids tilstandspuls (med et øyeblikksbilde av kjernevisningen). Terminalutdata, titler og tastetrykk logges aldri — kun ID-er, størrelser, byteantall og varigheter.
nl: Registreert de tmux -CC reconcile/apply-tijdlijn, verzonden commando’s, de hervat-watchdog en een live-status-heartbeat (met een momentopname van de core-viewer). Terminaluitvoer, titels en toetsaanslagen worden nooit gelogd — alleen id’s, groottes, bytetellingen en duur.
pl: Rejestruje oś czasu uzgadniania/stosowania tmux -CC, wysłane polecenia, watchdog wznawiania oraz puls stanu na żywo (wraz z migawką podglądu rdzenia). Dane wyjściowe terminala, tytuły ani naciśnięcia klawiszy nie są nigdy rejestrowane — tylko identyfikatory, rozmiary, liczby bajtów i czasy trwania.
pt_br: Registra a linha do tempo de reconciliação/aplicação do tmux -CC, os comandos enviados, o watchdog de retomada e um heartbeat de estado em tempo real (com um instantâneo do visualizador do core). A saída do terminal, os títulos e as teclas digitadas nunca são registrados — apenas ids, tamanhos, contagens de bytes e durações.
pt_pt: Regista a cronologia de reconciliação/aplicação do tmux -CC, os comandos enviados, o watchdog de retoma e um heartbeat de estado em tempo real (com um instantâneo do visualizador do core). A saída do terminal, os títulos e as teclas premidas nunca são registados — apenas ids, tamanhos, contagens de bytes e durações.
ro: Înregistrează cronologia de reconciliere/aplicare tmux -CC, comenzile trimise, supraveghetorul de reluare și un puls de stare în timp real (cu o captură a vizualizatorului din nucleu). Ieșirea terminalului, titlurile și apăsările de taste nu sunt niciodată înregistrate — doar id-uri, dimensiuni, numărul de octeți și durate.
sl: Beleži časovnico usklajevanja/uveljavljanja tmux -CC, poslane ukaze, nadzornika nadaljevanja in srčni utrip stanja v živo (s posnetkom prikazovalnika jedra). Izhod terminala, naslovi in pritiski tipk se nikoli ne beležijo — samo ID-ji, velikosti, števila bajtov in trajanja.
sv: Loggar tmux -CC:s tidslinje för avstämning/tillämpning, skickade kommandon, återupptagningsvakten och en hjärtslagssignal för livetillstånd (med en ögonblicksbild av kärnvisaren). Terminalutdata, titlar och tangenttryckningar loggas aldrig — endast id:n, storlekar, byteantal och varaktigheter.
uk: Записує хронологію узгодження/застосування tmux -CC, надіслані команди, сторожовий таймер відновлення та сигнал живого стану (зі знімком переглядача ядра). Вивід терміналу, заголовки та натискання клавіш ніколи не записуються в журнал — лише ідентифікатори, розміри, кількість байтів і тривалості.
vi: Ghi lại dòng thời gian đối chiếu/áp dụng của tmux -CC, các lệnh đã gửi, bộ giám sát khôi phục và tín hiệu nhịp trạng thái trực tiếp (kèm ảnh chụp nhanh trình xem lõi). Đầu ra terminal, tiêu đề và thao tác gõ phím không bao giờ được ghi lại — chỉ ghi id, kích thước, số byte và thời lượng.
zh_hans: 记录 tmux -CC 的协调/应用时间线、发送的命令、恢复看门狗以及实时状态心跳（含核心查看器快照）。终端输出、标题和按键内容绝不会被记录，仅记录 ID、尺寸、字节数和时长。
zh_hant: 記錄 tmux -CC 的協調/套用時間軸、已傳送的指令、恢復監視程式，以及即時狀態心跳（含核心檢視器快照）。終端機輸出、標題與按鍵永遠不會被記錄 — 僅記錄 ID、尺寸、位元組數與持續時間。
